import xadmin
from .models import Salary01
class test2():
    list_display=['周期','员工编号','平时加班时数','周末加班时数','节日加班时数','有薪假时数','法定假时数','基本工资','平均时薪','法定日平均工资','平时加班费','公休日加班费','节日加班费','有薪假工资','法定假工资','最低工资补助','计件工资','全勤奖','应发工资','工龄奖','公积金','社保','实发工资','个税','保健补助','应税额','id']
    search_fields = ['周期','员工编号','平时加班时数','周末加班时数','节日加班时数','有薪假时数','法定假时数','基本工资','平均时薪','法定日平均工资','平时加班费','公休日加班费','节日加班费','有薪假工资','法定假工资','最低工资补助','计件工资','全勤奖','应发工资','工龄奖','公积金','社保','实发工资','个税','保健补助','应税额','id']
    list_filter = ['周期','员工编号','平时加班时数','周末加班时数','节日加班时数','有薪假时数','法定假时数','基本工资','平均时薪','法定日平均工资','平时加班费','公休日加班费','节日加班费','有薪假工资','法定假工资','最低工资补助','计件工资','全勤奖','应发工资','工龄奖','公积金','社保','实发工资','个税','保健补助','应税额','id']
    show_detail_fields = ['员工编号']
    list_filter =['周期','员工编号',]
    refresh_times = (3,5)     # 数据刷新时间

    # data_charts = {
    #     "user_count": {'title': u"工资统计",
    #                    "x-field": "周期",
    #                    "y-field": ("周期",),
    #                    },
    # }
    # list_per_page = 10
    # # 相应表图标配置
    # # https://fontawesome.com/icons
    # model_icon = 'fa fa-address-book'
    # 执行动作框的位置
    # actions_on_top = True
    actions_on_bottom = True



xadmin.site.register(Salary01,test2)
